Reports/ПланыЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ПланыЗакупок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ПланыЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ПланыЗакупок</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЗакупок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыКонтрагентов</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС14</Name>
					<Comment>(Общ) Ставка НДС 14%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ПланыЗакупок/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		
		ТипЦен = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойТипЦенПродажи");
		
	КонецЕсли;
	
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Описание исходного текста запроса.
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Планы.Период КАК ДатаПланирования,
	|	Планы.Период КАК ПериодПланирования,
	|	Планы.Сценарий.Периодичность КАК СценарийПериодичность,
	|	Планы.Сценарий КАК Сценарий,
	|	ПРЕДСТАВЛЕНИЕ(Планы.Сценарий),
	|	Планы.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(Планы.Подразделение),
	|	Планы.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(Планы.Номенклатура),
	|	Планы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(Планы.ХарактеристикаНоменклатуры),
	|	Планы.ДокументПланирования КАК ДокументПланирования,
	|	ПРЕДСТАВЛЕНИЕ(Планы.ДокументПланирования),
	|	Планы.Проект КАК Проект,
	|	ПРЕДСТАВЛЕНИЕ(Планы.Проект),
	|	Планы.Заказ КАК Заказ,
	|	ПРЕДСТАВЛЕНИЕ(Планы.Заказ),
	|	Планы.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(Планы.Контрагент),
	|	Планы.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(Планы.Договор),
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|		КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|						ТОГДА 20
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) / 100 * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) КАК Цена,
	|	ЦеныСрезПоследних.Валюта КАК Валюта,
	|	Планы.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(Планы.Регистратор),
	|	Планы.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(Планы.Период, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(Планы.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(Планы.Период, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(Планы.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(Планы.Период, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(Планы.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(Планы.Период, ГОД) КАК ПериодГод,
	|	Планы.КоличествоОборот КАК Количество,
	|	Планы.КоличествоОборот * Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоБазовыхЕдиниц,
	|	Планы.КоличествоОборот * Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / Планы.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК КоличествоЕдиницОтчетов,
	|	Планы.СтоимостьОборот КАК СтоимостьУпр,
	|	Планы.НДСОборот КАК НДСУпр,
	|	Планы.СтоимостьОборот + Планы.НДСОборот КАК СтоимостьСНДСУпр,
	|	Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|		КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|						ТОГДА 20
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) КАК СтоимостьПоТипуЦенУпр,
	|	ВЫБОР
	|		КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|				КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|					ТОГДА ВЫБОР
	|							КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|								ТОГДА 20
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Планы.СтоимостьОборот + Планы.НДСОборот - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|				КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|					ТОГДА ВЫБОР
	|							КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|								ТОГДА 20
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность)
	|	КОНЕЦ КАК ОтклонениеСтоимостиУпр,
	|	ВЫБОР
	|		КОГДА Планы.СтоимостьОборот + Планы.НДСОборот = 0
	|				ИЛИ ВЫБОР
	|					КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) = 0
	|						ТОГДА 0
	|					ИНАЧЕ Планы.СтоимостьОборот + Планы.НДСОборот - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность)
	|				КОНЕЦ = 0
	|				ИЛИ Планы.СтоимостьОборот + Планы.НДСОборот - ВЫБОР
	|					КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) = 0
	|						ТОГДА 0
	|					ИНАЧЕ Планы.СтоимостьОборот + Планы.НДСОборот - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность)
	|				КОНЕЦ = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) = 0
	|					ТОГДА 0
	|				ИНАЧЕ Планы.СтоимостьОборот + Планы.НДСОборот - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность)
	|			КОНЕЦ * 100 / (Планы.СтоимостьОборот + Планы.НДСОборот - ВЫБОР
	|				КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) = 0
	|					ТОГДА 0
	|				ИНАЧЕ Планы.СтоимостьОборот + Планы.НДСОборот - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность)
	|			КОНЕЦ)
	|	КОНЕЦ КАК ОтклонениеСтоимостиУпрПроцент,
	|	Планы.СтоимостьОборот * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) КАК СтоимостьРегл,
	|	Планы.НДСОборот * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) КАК НДСРегл,
	|	(Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) КАК СтоимостьСНДСРегл,
	|	Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|		КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|						ТОГДА 20
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) КАК СтоимостьПоТипуЦенРегл,
	|	ВЫБОР
	|		КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|				КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|					ТОГДА ВЫБОР
	|							КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|								ТОГДА 20
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|				КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|					ТОГДА ВЫБОР
	|							КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|								ТОГДА 20
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность)
	|	КОНЕЦ КАК ОтклонениеСтоимостиРегл,
	|	ВЫБОР
	|		КОГДА (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) = 0
	|				ИЛИ ВЫБОР
	|					КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) = 0
	|						ТОГДА 0
	|					ИНАЧЕ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность)
	|				КОНЕЦ = 0
	|				ИЛИ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - ВЫБОР
	|					КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) = 0
	|						ТОГДА 0
	|					ИНАЧЕ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность)
	|				КОНЕЦ = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) = 0
	|					ТОГДА 0
	|				ИНАЧЕ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность)
	|			КОНЕЦ * 100 / ((Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - ВЫБОР
	|				КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) = 0
	|					ТОГДА 0
	|				ИНАЧЕ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность)
	|			КОНЕЦ)
	|	КОНЕЦ КАК ОтклонениеСтоимостиРеглПроцент
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	ПериодПланирования,
	|	Сценарий.*,
	|	Подразделение.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	ДокументПланирования.*,
	|	Проект.*,
	|	Заказ.*,
	|	Контрагент.*,
	|	Договор.*,
	|	Цена,
	|	Валюта,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоБазовыхЕдиниц,
	|	КоличествоЕдиницОтчетов,
	|	СтоимостьУпр,
	|	НДСУпр,
	|	СтоимостьСНДСУпр,
	|	СтоимостьПоТипуЦенУпр,
	|	ОтклонениеСтоимостиУпр,
	|	ОтклонениеСтоимостиУпрПроцент,
	|	СтоимостьРегл,
	|	НДСРегл,
	|	СтоимостьСНДСРегл,
	|	СтоимостьПоТипуЦенРегл,
	|	ОтклонениеСтоимостиРегл,
	|	ОтклонениеСтоимостиРеглПроцент
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ
	|	РегистрНакопления.ПланыЗакупок.Обороты(&ДатаНач, &ДатаКон, Регистратор {&Периодичность}, {Сценарий.* КАК Сценарий, Подразделение.* КАК Подразделение, Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументПланирования.* КАК ДокументПланирования, Проект.* КАК Проект, Заказ.* КАК Заказ, Контрагент.* КАК Контрагент, Договор.* КАК Договор}) КАК Планы
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаКон, ТипЦен = &ТипЦен {Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры}) КАК ЦеныСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсВалютыЦены
	|			ПО КурсВалютыЦены.Валюта = ЦеныСрезПоследних.Валюта
	|		ПО Планы.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|			И Планы.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры}
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|		КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|						ТОГДА 20
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) / 100 * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) КАК Цена,
	|	Планы.Регистратор КАК Регистратор,
	|	Планы.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(Планы.Период, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(Планы.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(Планы.Период, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(Планы.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(Планы.Период, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(Планы.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(Планы.Период, ГОД) КАК ПериодГод,
	|	Планы.КоличествоОборот КАК Количество,
	|	Планы.КоличествоОборот * Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоБазовыхЕдиниц,
	|	Планы.КоличествоОборот * Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / Планы.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК КоличествоЕдиницОтчетов,
	|	Планы.СтоимостьОборот КАК СтоимостьУпр,
	|	Планы.НДСОборот КАК НДСУпр,
	|	Планы.СтоимостьОборот + Планы.НДСОборот КАК СтоимостьСНДСУпр,
	|	Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|		КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|						ТОГДА 20
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) КАК СтоимостьПоТипуЦенУпр,
	|	ВЫБОР
	|		КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|				КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|					ТОГДА ВЫБОР
	|							КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|								ТОГДА 20
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Планы.СтоимостьОборот + Планы.НДСОборот - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|				КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|					ТОГДА ВЫБОР
	|							КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|								ТОГДА 20
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность)
	|	КОНЕЦ КАК ОтклонениеСтоимостиУпр,
	|	ВЫБОР
	|		КОГДА Планы.СтоимостьОборот + Планы.НДСОборот = 0
	|				ИЛИ ВЫБОР
	|					КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) = 0
	|						ТОГДА 0
	|					ИНАЧЕ Планы.СтоимостьОборот + Планы.НДСОборот - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность)
	|				КОНЕЦ = 0
	|				ИЛИ Планы.СтоимостьОборот + Планы.НДСОборот - ВЫБОР
	|					КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) = 0
	|						ТОГДА 0
	|					ИНАЧЕ Планы.СтоимостьОборот + Планы.НДСОборот - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность)
	|				КОНЕЦ = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) = 0
	|					ТОГДА 0
	|				ИНАЧЕ Планы.СтоимостьОборот + Планы.НДСОборот - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность)
	|			КОНЕЦ * 100 / (Планы.СтоимостьОборот + Планы.НДСОборот - ВЫБОР
	|				КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность) = 0
	|					ТОГДА 0
	|				ИНАЧЕ Планы.СтоимостьОборот + Планы.НДСОборот - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьУпр) / (&КурсУпр * КурсВалютыЦены.Кратность)
	|			КОНЕЦ)
	|	КОНЕЦ КАК ОтклонениеСтоимостиУпрПроцент,
	|	Планы.СтоимостьОборот * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) КАК СтоимостьРегл,
	|	Планы.НДСОборот * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) КАК НДСРегл,
	|	(Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) КАК СтоимостьСНДСРегл,
	|	Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|		КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|						ТОГДА 20
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) КАК СтоимостьПоТипуЦенРегл,
	|	ВЫБОР
	|		КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|				КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|					ТОГДА ВЫБОР
	|							КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|								ТОГДА 20
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|				КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|					ТОГДА ВЫБОР
	|							КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|								ТОГДА 20
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность)
	|	КОНЕЦ КАК ОтклонениеСтоимостиРегл,
	|	ВЫБОР
	|		КОГДА (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) = 0
	|				ИЛИ ВЫБОР
	|					КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) = 0
	|						ТОГДА 0
	|					ИНАЧЕ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность)
	|				КОНЕЦ = 0
	|				ИЛИ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - ВЫБОР
	|					КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) = 0
	|						ТОГДА 0
	|					ИНАЧЕ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|							КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|								ТОГДА ВЫБОР
	|										КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|											ТОГДА 20
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность)
	|				КОНЕЦ = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) = 0
	|					ТОГДА 0
	|				ИНАЧЕ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность)
	|			КОНЕЦ * 100 / ((Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - ВЫБОР
	|				КОГДА Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность) = 0
	|					ТОГДА 0
	|				ИНАЧЕ (Планы.СтоимостьОборот + Планы.НДСОборот) * (&КурсУпр * &КратностьРегл) / (&КурсРегл * &КратностьУпр) - Планы.КоличествоОборот * (ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ВЫБОР
	|						КОГДА ЦеныСрезПоследних.ТипЦен.ЦенаВключаетНДС = ЛОЖЬ
	|							ТОГДА ВЫБОР
	|									КОГДА Планы.Номенклатура.СтавкаНДС = &НДС20
	|										ТОГДА 20
	|									ИНАЧЕ 0
	|								КОНЕЦ
	|						ИНАЧЕ 0
	|					КОНЕЦ) / 100) * (Планы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент) * (КурсВалютыЦены.Курс * &КратностьРегл) / (&КурсРегл * КурсВалютыЦены.Кратность)
	|			КОНЕЦ)
	|	КОНЕЦ КАК ОтклонениеСтоимостиРеглПроцент
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПланирования
	|{УПОРЯДОЧИТЬ ПО
	|	Сценарий.*,
	|	Подразделение.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	ДокументПланирования.*,
	|	Проект.*,
	|	Заказ.*,
	|	Контрагент.*,
	|	Договор.*,
	|	Цена,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоБазовыхЕдиниц,
	|	КоличествоЕдиницОтчетов,
	|	СтоимостьУпр,
	|	НДСУпр,
	|	СтоимостьСНДСУпр,
	|	СтоимостьПоТипуЦенУпр,
	|	ОтклонениеСтоимостиУпр,
	|	ОтклонениеСтоимостиУпрПроцент,
	|	СтоимостьРегл,
	|	НДСРегл,
	|	СтоимостьСНДСРегл,
	|	СтоимостьПоТипуЦенРегл,
	|	ОтклонениеСтоимостиРегл,
	|	ОтклонениеСтоимостиРеглПроцент
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|	
	|ИТОГИ
	|	ВЫБОР
	|		КОГДА Сценарий ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА СценарийПериодичность = &ПериодГод
	|						ТОГДА ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|					КОГДА СценарийПериодичность = &ПериодПолугодие
	|						ТОГДА ""Полугодие с "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 1, 10)
	|					КОГДА СценарийПериодичность = &ПериодКвартал
	|						ТОГДА ПРЕДСТАВЛЕНИЕ(КВАРТАЛ(ДатаПланирования)) + "" квартал "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|					КОГДА СценарийПериодичность = &ПериодМесяц
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 1
	|									ТОГДА ""Январь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 2
	|									ТОГДА ""Февраль "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 3
	|									ТОГДА ""Март "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 4
	|									ТОГДА ""Апрель "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 5
	|									ТОГДА ""Май "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 6
	|									ТОГДА ""Июнь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 7
	|									ТОГДА ""Июль "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 8
	|									ТОГДА ""Август "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 9
	|									ТОГДА ""Сентябрь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 10
	|									ТОГДА ""Октябрь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 11
	|									ТОГДА ""Ноябрь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|								КОГДА МЕСЯЦ(ДатаПланирования) = 12
	|									ТОГДА ""Декабрь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 7, 4) + "" г.""
	|							КОНЕЦ
	|					КОГДА СценарийПериодичность = &ПериодДекада
	|						ТОГДА ""Декада с "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 1, 10)
	|					КОГДА СценарийПериодичность = &ПериодНеделя
	|						ТОГДА ""Неделя с "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 1, 10)
	|					КОГДА СценарийПериодичность = &ПериодДень
	|						ТОГДА ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 1, 10)
	|				КОНЕЦ
	|		ИНАЧЕ ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ДатаПланирования), 1, 10)
	|	КОНЕЦ КАК ПериодПланирования,
	|	СУММА(Количество),
	|	СУММА(КоличествоБазовыхЕдиниц),
	|	СУММА(КоличествоЕдиницОтчетов),
	|	СУММА(СтоимостьУпр),
	|	СУММА(НДСУпр),
	|	СУММА(СтоимостьСНДСУпр),
	|	СУММА(СтоимостьПоТипуЦенУпр),
	|	СУММА(ОтклонениеСтоимостиУпр),
	|	ВЫБОР
	|		КОГДА СУММА(СтоимостьСНДСУпр) = 0
	|				ИЛИ СУММА(ОтклонениеСтоимостиУпр) = 0
	|				ИЛИ СУММА(СтоимостьСНДСУпр) - СУММА(ОтклонениеСтоимостиУпр) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ОтклонениеСтоимостиУпр) * 100 / (СУММА(СтоимостьСНДСУпр) - СУММА(ОтклонениеСтоимостиУпр))
	|	КОНЕЦ КАК ОтклонениеСтоимостиУпрПроцент,
	|	СУММА(СтоимостьРегл),
	|	СУММА(НДСРегл),
	|	СУММА(СтоимостьСНДСРегл),
	|	СУММА(СтоимостьПоТипуЦенРегл),
	|	СУММА(ОтклонениеСтоимостиРегл),
	|	ВЫБОР
	|		КОГДА СУММА(СтоимостьСНДСРегл) = 0
	|				ИЛИ СУММА(ОтклонениеСтоимостиРегл) = 0
	|				ИЛИ СУММА(СтоимостьСНДСРегл) - СУММА(ОтклонениеСтоимостиРегл) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ОтклонениеСтоимостиРегл) * 100 / (СУММА(СтоимостьСНДСРегл) - СУММА(ОтклонениеСтоимостиРегл))
	|	КОНЕЦ КАК ОтклонениеСтоимостиРеглПроцент,
	|	СРЕДНЕЕ(Цена),
	|	МАКСИМУМ(Валюта)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
	|	ОБЩИЕ,
	|	Сценарий,
	|	ПериодПланирования
	|{ИТОГИ ПО
	|	ПериодПланирования,
	|	Сценарий.*,
	|	Подразделение.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	ДокументПланирования.*,
	|	Проект.*,
	|	Заказ.*,
	|	Контрагент.*,
	|	Договор.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";

	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Планы.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Планы.Номенклатура", "Номенклатура", НСтр("ru='Номенклатурная группа';uk='Номенклатурна група'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_НоменклатурныеГруппы);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Планы.ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры", НСтр("ru='Характеристика номенклатуры';uk='Характеристика номенклатури'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Планы.ДокументПланирования", "ДокументПланирования", НСтр("ru='Документ планирования';uk='Документ планування'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Планы.Заказ", "Заказ", НСтр("ru='Заказ';uk='Замовлення'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Планы.Контрагент", "Контрагент", "Контрагент", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Планы.Договор", "Договор", НСтр("ru='Договор';uk='Договір'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПериодПланирования", НСтр("ru='Период планирования';uk='Період планування'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сценарий", НСтр("ru='Сценарий';uk='Сценарій'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", НСтр("ru='Подразделение';uk='Підрозділ'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Номенклатура", НСтр("ru='Номенклатура';uk='Номенклатура'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаНоменклатуры", НСтр("ru='Характеристика номенклатуры';uk='Характеристика номенклатури'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументПланирования", НСтр("ru='Документ планирования';uk='Документ планування'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Проект", НСтр("ru='Проект';uk='Проект'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Заказ", НСтр("ru='Заказ';uk='Замовлення'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент", НСтр("ru='Контрагент';uk='Контрагент'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Договор", НСтр("ru='Договор';uk='Договір'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Цена", НСтр("ru='Цена (тип цен)';uk='Ціна (тип цін)'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Валюта", НСтр("ru='Валюта (тип цен)';uk='Валюта (тип цін)'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Количество", НСтр("ru='Количество (в единицах хранения)';uk='Кількість (в одиницях зберігання)'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоБазовыхЕдиниц", НСтр("ru='Количество (в базовых ед.)';uk='Кількість (у базових од.)'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоЕдиницОтчетов", НСтр("ru='Количество (в единицах отчетов)';uk='Кількість (в одиницях звітів)'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьУпр", НСтр("ru='Стоимость (без НДС) - упр.';uk='Вартість (без ПДВ) - упр.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСУпр", НСтр("ru='НДС - упр.';uk='ПДВ - упр.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьСНДСУпр", НСтр("ru='Стоимость (с НДС) - упр.';uk='Вартість (з ПДВ) - упр.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьПоТипуЦенУпр", НСтр("ru='Стоимость (по типу цен) - упр.';uk='Вартість (по типу цін) - упр.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ОтклонениеСтоимостиУпр", НСтр("ru='Отклонение стоимости - упр.';uk='Відхилення вартості - упр.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ОтклонениеСтоимостиУпрПроцент", НСтр("ru='Отклонение стоимости (%) - упр.';uk='Відхилення вартості (%) - упр.'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьРегл", НСтр("ru='Стоимость (без НДС) - регл.';uk='Вартість (без ПДВ) - регл.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСРегл", НСтр("ru='НДС - регл.';uk='ПДВ - регл.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьСНДСРегл", НСтр("ru='Стоимость (с НДС) - регл.';uk='Вартість (з ПДВ) - регл.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьПоТипуЦенРегл", НСтр("ru='Стоимость (по типу цен) - регл.';uk='Вартість (по типу цін) - регл.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ОтклонениеСтоимостиРегл", НСтр("ru='Отклонение стоимости - регл.';uk='Відхилення вартості - регл.'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ОтклонениеСтоимостиРеглПроцент", НСтр("ru='Отклонение стоимости (%) - регл.';uk='Відхилення вартості (%) - регл.'"));
	
	// Добавление показателей
	УниверсальныйОтчет.ДобавитьПоказатель("Количество", НСтр("ru='Ед. хранения';uk='Од. зберігання'"), истина, "ЧЦ=15; ЧДЦ=3", "Количество", НСтр("ru='Количество';uk='Кількість'"));
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдиниц", НСтр("ru='Базовых ед.';uk='Базових од.'"), Ложь, "ЧЦ=15; ЧДЦ=3", "Количество", НСтр("ru='Количество';uk='Кількість'"));
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетов", НСтр("ru='Ед. отчетов';uk='Од. звітів'"), Ложь, "ЧЦ=15; ЧДЦ=3", "Количество", НСтр("ru='Количество';uk='Кількість'"));
	
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьУпр", НСтр("ru='Без НДС';uk='Без ПДВ'"), ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьУпр", НСтр("ru='Стоимость';uk='Вартість'") + Символы.ПС + НСтр("ru='в валюте упр. учета';uk='у валюті упр. обліку'"));
	УниверсальныйОтчет.ДобавитьПоказатель("НДСУпр", НСтр("ru='НДС';uk='ПДВ'"), ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьУпр");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьСНДСУпр", НСтр("ru='С НДС';uk='З ПДВ'"), истина, "ЧЦ=15; ЧДЦ=2", "СтоимостьУпр");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьПоТипуЦенУпр", НСтр("ru='По типу цен';uk='По типу цін'"), ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьУпр");
	УниверсальныйОтчет.ДобавитьПоказатель("ОтклонениеСтоимостиУпр", НСтр("ru='Отклонение';uk='Відхилення'"), ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьУпр");
	УниверсальныйОтчет.ДобавитьПоказатель("ОтклонениеСтоимостиУпрПроцент", НСтр("ru='Отклонение (%)';uk='Відхилення (%)'"), ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьУпр");
	
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьРегл", НСтр("ru='Без НДС';uk='Без ПДВ'"), ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьРегл", НСтр("ru='Стоимость';uk='Вартість'") + Символы.ПС + НСтр("ru='в валюте регл. учета';uk='у валюті регл. обліку'"));
	УниверсальныйОтчет.ДобавитьПоказатель("НДСРегл", НСтр("ru='НДС';uk='ПДВ'"), ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьРегл");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьСНДСРегл", НСтр("ru='С НДС';uk='З ПДВ'"), истина, "ЧЦ=15; ЧДЦ=2", "СтоимостьРегл");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьПоТипуЦенРегл", НСтр("ru='По типу цен';uk='По типу цін'"), ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьРегл");
	УниверсальныйОтчет.ДобавитьПоказатель("ОтклонениеСтоимостиРегл", НСтр("ru='Отклонение';uk='Відхилення'"), ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьРегл");
	УниверсальныйОтчет.ДобавитьПоказатель("ОтклонениеСтоимостиРеглПроцент", НСтр("ru='Отклонение (%)';uk='Відхилення (%)'"), ложь, "ЧЦ=15; ЧДЦ=2", "СтоимостьРегл");
	
	УниверсальныйОтчет.мСтруктураПериодов.Вставить("ПериодПланирования", 3);
	
	УниверсальныйОтчет.мСтруктураФорматаПолей.Вставить("Цена", "ЧЦ=15; ЧДЦ=2");
	
	// Добавление предопределенных группировок строк отчета.
	УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Очистить();
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Сценарий");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Подразделение");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ПериодПланирования");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	
	
	// Добавление предопределенных отборов отчета.
	УниверсальныйОтчет.ДобавитьОтбор("Сценарий");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи полей и измерений
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("Цена", "Номенклатура");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("Валюта", "Номенклатура");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("Цена", "ХарактеристикаНоменклатуры");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("Валюта", "ХарактеристикаНоменклатуры");
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	ВалютаУпр = МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаУправленческогоУчета"), УниверсальныйОтчет.ДатаКон);
	ВалютаРегл = МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаРегламентированногоУчета"), УниверсальныйОтчет.ДатаКон);
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("КурсРегл", ВалютаРегл.Курс);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("КратностьРегл", ВалютаРегл.Кратность);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("КурсУпр", ВалютаУпр.Курс);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("КратностьУпр", ВалютаУпр.Кратность);
		
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ТипЦен", ТипЦен);
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодДень", Перечисления.Периодичность.День);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодНеделя", Перечисления.Периодичность.Неделя);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодДекада", Перечисления.Периодичность.Декада);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодМесяц", Перечисления.Периодичность.Месяц);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодКвартал", Перечисления.Периодичность.Квартал);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодПолугодие", Перечисления.Периодичность.Полугодие);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодГод", Перечисления.Периодичность.Год);
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НДС20", Перечисления.СтавкиНДС.НДС20);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
